src/InformationRegisters/wsОчередьСообщений/wsОчередьСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>wsОчередьСообщений</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.АЭМ_РаспоряжениеНаПровес</types>
      <types>DocumentRef.ПеремещениеОС2_4</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ТранспортнаяНакладная</types>
      <types>DocumentRef.АЭМ_ПриходныйОрдерИзАСЖДВ</types>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>CatalogRef.wsТипыСообщений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.wsНаправлениеСообщения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/wsНаправлениеСообщения/wsНаправлениеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>wsНаправлениеСообщения</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

src/WebServices/intermech/Module.bsl
Функция ping()
	Возврат Истина;
КонецФункции

Функция LoadOperations(Сообщение)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипСообщения = Справочники.wsТипыСообщений.НайтиПоНаименованию("IntermechOperations");
	
	Приложение = wsОбработчики.ПодключитьОбработку(ТипСообщения, 
							Перечисления.wsНаправлениеСообщения.Входящее);
							
	Результат = Приложение.ВыполнитьПриложение(Сообщение);	
							
	ID = Неопределено;
	wsОбработчики.ЗаписатьСообщениеВОчередьСообщений(
		Сообщение, ТипСообщения, 
			Перечисления.wsНаправлениеСообщения.Входящее, ID,,Истина); // обработано...
		
	Возврат Результат;
		
КонецФункции

Функция _LoadOperations(Сообщение)

	УстановитьПривилегированныйРежим(Истина);
	
	ТипСообщения = Справочники.wsТипыСообщений.НайтиПоНаименованию("IntermechOperationsIn");
	
	ID = Неопределено;
	wsОбработчики.ЗаписатьСообщениеВОчередьСообщений(
		Сообщение, ТипСообщения, Перечисления.wsНаправлениеСообщения.Входящее, ID); 
		
	Если НЕ ЗначениеЗаполнено(ID) Тогда
		Возврат "Ошибка записи данных";
	КонецЕсли; 
	
	Возврат Сообщение;
	
	// дополнили сообщение в очереди...
	wsОбработчики.ОбработкаОчередиСообщений(ID);
	
	// отправили сообщение обратно...
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	wsОчередьСообщений.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.wsОчередьСообщений КАК wsОчередьСообщений
		|ГДЕ
		|	wsОчередьСообщений.IDСообщения = &IDСообщения";
	
	Запрос.УстановитьПараметр("IDСообщения", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Ответ = Новый ХранилищеЗначения(Выборка.Сообщение, Новый СжатиеДанных(9));

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;

КонецФункции
